<template>
  <div>
    <router-link to="/" class="link">В игру!!!</router-link>
    <h2>Правила игры</h2>
    <p>
      В игре участвуют два игрока, у обоих есть колода карт ранга от 0 до 4, в
      которой находится по четыре карты каждого ранга.
    </p>
    <p>
      Перед началом игры колода каждого игрока перемешивается случайным образом
      и трансформируется в очередь.
    </p>
    <p>
      Далее, каждый игрок достаёт три карты из очереди и выкладывает их на стол
      рубашкой вниз. Это 'защита' каждого из игроков.
    </p>
    <p>Затем, с помощью жребия определяется очерёдность хода.</p>
    <p>Игрок, который ходит, считается атакующим.</p>
    <p>
      Во время хода атакующий игрок достаёт карту из очереди и, сравнивая её
      ранг с картами из 'защиты' оппонента бьёт любую карту с меньшим рангом.
    </p>
    <p>
      Ход продолжается, пока у защищающегося игрока есть непобитые карты защиты
      или очередная карта атакующего не смогла побить карту защищающегося.
    </p>
    <p>
      В конце хода атакующий игрок забирает себе все побитые карты защиты, а
      защищающийся - карту атакующего, которая не смогла пробить его защиту (в
      случае неудачной атаки).
    </p>
    <p>
      Полученные карты добавляются в колоду каждого из игроков по правилам
      очереди.
    </p>
    <p>
      В случае, если защита была полностью пробита - защищающийся получает
      штрафное очко.
    </p>
    <p>
      Перед каждым новым ходом игроки восстанавливают свою защиту доставая карты
      из своей колоды (очереди).
    </p>
    <p>После каждого хода игроки меняются ролями.</p>
    <p>
      Проигравшим считается тот, кто не сможет сделать очередной ход или тот,
      кто первым получит заранее установленное количество штрафных очков
      (переменное значение).
    </p>
    <ul>
      Правила боя карт:
      <li>
        Бой карт происходит сравнением их рангов: чей ранг выше, так карта и
        сильнее, с одним исключением: карту ранга 4 может побить только карта
        ранга 0;
      </li>
      <li>
        При одинаковом ранге карт атакующий игрок помещает свою карту в очередь
        и достаёт оттуда новую;
      </li>
    </ul>
    <p>Чтобы сделать ход, нажмите на свою очередь.</p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
export default defineComponent({
  name: "GameRules",
});
</script>

<style>
p,
ul {
  font-size: 20px;
}
</style>
